# Homebrew casks (one token per line). Reconciled vs: brew list --cask
# Lines starting with # are ignored.
1password
caffeine
claude-code
cursor
dbngin
discord
docker-desktop
firefox
font-lato
font-open-sans
font-roboto
font-source-code-pro
font-source-code-pro-for-powerline
font-source-sans-3
font-source-serif-4
github
google-chrome
iterm2
ollama-app
powershell
slack
telegram
visual-studio-code
whatsapp
zoom
zwift
